
## :x: Apply Failed

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8220186325)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pagerduty_user.pd_user["imparapoc03@gmail.com"] will be created
  + resource "pagerduty_user" "pd_user" {
      + avatar_url      = (known after apply)
      + color           = (known after apply)
      + description     = "Managed by Terraform"
      + email           = "imparapoc03@gmail.com"
      + html_url        = (known after apply)
      + id              = (known after apply)
      + invitation_sent = (known after apply)
      + license         = (known after apply)
      + name            = "Poc User"
      + role            = "limited_user"
      + teams           = (known after apply)
      + time_zone       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Creating...
╷
│ Error: POST API call to https://api.pagerduty.com/users failed 400 Bad Request. Code: 2001, Errors: [Email address imparapoc03@gmail.com is not allowed. Email addresses must use these domains: 'fastretailing.com', 'uniqlo-usa.com', 'uniqlo.ca'], Message: Invalid Input Provided
│ 
│   with pagerduty_user.pd_user["imparapoc03@gmail.com"],
│   on pagerduty_user.tf line 1, in resource "pagerduty_user" "pd_user":
│    1: resource "pagerduty_user" "pd_user" {
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":1,"Program":"tfcmt","SHA1":"bf7d387dde28e4f057e6082927f1c2a442411dd7","Vars":{},"WorkflowName":"Plan"} -->